УРВ_файловая/src/InformationRegisters/ГолосаПользователейЗаПожелания/ГолосаПользователейЗаПожелания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГолосаПользователейЗаПожелания</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Голос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пожелание</name>
    <type>
      <types>CatalogRef.Пожелания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/ГолосаПользователейЗаПожелания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ДобавитьДвижение(Движения, Дата, Пожелание, Пользователь, Голос) Экспорт
	
 	Движения.ГолосаПользователейЗаПожелания.Записывать = Истина;
	НовоеДвижение = Движения.ГолосаПользователейЗаПожелания.Добавить();
	НовоеДвижение.Дата = Дата;
	НовоеДвижение.Пожелание = Пожелание;
	НовоеДвижение.Пользователь = Пользователь;
	НовоеДвижение.Голос = Голос;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
